Repository: Forte11Cuba/ern
Catalog: lib/core/l10n/app_*.arb
Languages: es

# appName
source: Neurocognitive Risk Scale
es: Escala de Riesgo Neurocognitivo

# scaleFormalName
source: Predictive Scale for Mild Neurocognitive Disorder due to Alzheimer's Disease
es: Escala predictiva de Trastorno Neurocognitivo Leve debido a la Enfermedad de Alzheimer

# dashboard
source: Summary
es: Resumen

source: Patients
es: Pacientes

source: Analytics
es: Analíticas

source: Reminders
es: Recordatorios

source: Export data
es: Exportar datos

source: Settings
es: Ajustes

source: About
es: Acerca de

source: New assessment
es: Nueva evaluación

source: Edit assessment
es: Editar evaluación

source: Save assessment
es: Guardar evaluación

source: Save changes
es: Guardar cambios

source: Result
es: Resultado

source: History
es: Historial

source: Search
es: Buscar

source: Filters
es: Filtros

# clearFilters
source: Clear
es: Limpiar

source: Cancel
es: Cancelar

source: Confirm
es: Confirmar

source: Close
es: Cerrar

source: Loading...
es: Cargando...

# totalPatients
source: Patients
es: Pacientes

# totalAssessments
source: Assessments
es: Evaluaciones

source: High risk
es: Alto riesgo

source: Low risk
es: Bajo riesgo

source: Category
es: Categoría

source: Version
es: Versión

source: Average
es: Promedio

source: Quick access
es: Acceso rápido

# patientsSubtitle
source: View, search or register patients
es: Ver lista, buscar o registrar pacientes

# analyticsSubtitle
source: Distribution, trends and correlations
es: Distribución, tendencias y correlaciones

# remindersSubtitle
source: Pending and overdue reevaluations
es: Reevaluaciones pendientes y vencidas

# exportSubtitle
source: CSV and PDF with filters for research
es: CSV y PDF con filtros para investigación

# aboutSubtitle
source: Scale, scientific evidence and credits
es: Escala, evidencia científica y créditos

source: Patient code
es: Código del paciente

# patientName
source: Name / Initials
es: Nombre / Iniciales

source: Age
es: Edad

source: Sex
es: Sexo

source: Male
es: Masculino

source: Female
es: Femenino

# birthDate
source: Date of birth
es: Fecha de nacimiento

source: Medical record
es: Historia clínica

source: Notes
es: Notas

source: Clinical notes
es: Notas clínicas

source: Required
es: Requerido

source: Invalid age
es: Edad inválida

source: New patient
es: Nuevo paciente

source: Edit patient
es: Editar paciente

source: Register patient
es: Registrar paciente

source: Patient updated
es: Paciente actualizado

source: Patient registered
es: Paciente registrado

# noPatients
source: No patients registered
es: No hay pacientes registrados

source: No results
es: Sin resultados

# searchHint
source: Search by code, name or record...
es: Buscar por código, nombre o historia...

source: Patient data
es: Datos del paciente

source: Assessments
es: Evaluaciones

# noAssessments
source: No assessments yet
es: Sin evaluaciones aún

# hypertension
source: Arterial hypertension
es: Hipertensión arterial

# lowCompetence
source: Low competence level
es: Bajo nivel de competencias

# lowEducation
source: Low education level
es: Bajo nivel de escolaridad

source: Obesity
es: Obesidad

source: Weight loss
es: Pérdida de peso

# inactivity
source: Physical inactivity
es: Inactividad física

source: Smoking
es: Tabaquismo

source: Yes
es: Sí

source: Risk factors
es: Factores de riesgo

source: Recommendation
es: Recomendación

# highRiskRecommendation
source: Patient classified as HIGH RISK for neurocognitive decline. Recommendations: • Formal neuropsychological evaluation • Strict cardiovascular risk factor control • Lifestyle intervention • Periodic follow-up
es: Paciente clasificado como ALTO RIESGO de deterioro neurocognitivo. Se recomienda: • Evaluación neuropsicológica formal • Control estricto de factores cardiovasculares • Intervención sobre estilo de vida • Seguimiento periódico

# lowRiskRecommendation
source: Patient classified as LOW RISK. Recommendations: • Maintain healthy habits • Periodic reevaluation
es: Paciente clasificado como BAJO RIESGO. Se recomienda: • Mantener hábitos saludables • Reevaluación periódica

source: Share
es: Compartir

source: Edit
es: Editar

# pdfAvailableSoon
source: PDF available in next version
es: PDF disponible en próxima versión

source: Assessment detail
es: Detalle evaluación

source: Version history
es: Historial de versiones

# currentVersion
source: current
es: actual

source: Previous versions
es: Versiones anteriores

# changesVsCurrent
source: Changes vs current version:
es: Cambios respecto a versión actual:

# factorsInVersion
source: Factors in this version:
es: Factores en esta versión:

# noVersions
source: No previous versions
es: No hay versiones anteriores

source: Compare
es: Comparar

source: Comparison
es: Comparativa

source: Compare evaluations
es: Comparar evaluaciones

# selectTwoAssessments
source: Select 2 evaluations
es: Selecciona 2 evaluaciones

source: Previous
es: Anterior

source: Recent
es: Reciente

source: Factor comparison
es: Comparativa de factores

source: Summary
es: Resumen

source: Previous assessment
es: Evaluación anterior

source: Recent assessment
es: Evaluación reciente

source: Score difference
es: Diferencia de score

source: Category change
es: Cambio de categoría

source: No change
es: Sin cambio

source: Modified factors
es: Factores modificados

# evolutionChart
source: Score evolution
es: Evolución del score

source: Cutoff
es: Corte

source: Date
es: Fecha

# datePrefix
source: Date: {date}
es: Fecha: {date}

source: Risk category
es: Categoría de riesgo

source: All
es: Todos

source: Date range
es: Rango de fechas

source: From
es: Desde

source: To
es: Hasta

source: Active factors
es: Factores presentes

# noResultsWithFilters
source: No results with applied filters
es: Sin resultados con los filtros aplicados

source: Pending
es: Pendientes

source: Overdue
es: Vencidos

source: No pending reminders
es: No hay recordatorios pendientes

source: No overdue reminders
es: No hay recordatorios vencidos

source: Reminder completed
es: Recordatorio completado

source: Mark completed
es: Marcar completado

# scheduledFor
source: Scheduled
es: Programada

# overdueDays
source: Overdue by {days} days
es: Vencida hace {days} días

# inDays
source: In {days} days ({months} months)
es: En {days} días ({months} meses)

source: Export filters
es: Filtros de exportación

source: Export format
es: Formato de exportación

source: Export CSV
es: Exportar CSV

# csvSubtitle
source: Comma-separated text file
es: Archivo de texto separado por comas

source: Statistics PDF
es: PDF de estadísticas

# statisticsPdfSubtitle
source: Aggregate report with distribution and frequencies
es: Reporte agregado con distribución y frecuencias

source: Clear dates
es: Limpiar fechas

source: Score distribution
es: Distribución de scores

source: Most frequent factors
es: Factores más frecuentes

source: Temporal trend
es: Tendencia temporal

# factorCorrelation
source: Factor correlation (high risk)
es: Correlación de factores (alto riesgo)

# commonCombinations
source: Most common combinations in high risk patients
es: Combinaciones más comunes en pacientes de alto riesgo

source: No assessments to show
es: No hay evaluaciones para mostrar

source: Theme
es: Tema

# themeLight
source: Light
es: Claro

# themeDark
source: Dark
es: Oscuro

# themeSystem
source: System
es: Sistema

source: Select theme
es: Seleccionar tema

source: Appearance
es: Apariencia

source: Information
es: Información

source: Accessibility
es: Accesibilidad

source: Font size
es: Tamaño de fuente

# fontSmall
source: Small
es: Pequeño

# fontMedium
source: Medium
es: Mediano

# fontLarge
source: Large
es: Grande

source: High contrast
es: Alto contraste

# highContrastSubtitle
source: Higher contrast for low light use
es: Mayor contraste para uso con poca luz

source: Language
es: Idioma

source: Spanish
es: Español

source: English
es: Inglés

source: About the scale
es: Acerca de la escala

# scaleDescription
source: Predictive Scale for Mild Neurocognitive Disorder due to Alzheimer's Disease. A clinical tool designed to assess the risk of neurocognitive decline in patients through 9 binary risk factors.
es: Escala predictiva de Trastorno Neurocognitivo Leve debido a la Enfermedad de Alzheimer. Herramienta clínica para evaluar el riesgo de deterioro neurocognitivo en pacientes a través de 9 factores de riesgo binarios.

source: Scale parameters
es: Parámetros de la escala

source: Range
es: Rango

source: Cutoff point
es: Punto de corte

source: Categories
es: Categorías

source: Factors
es: Factores

source: Weights per factor
es: Pesos por factor

source: points
es: puntos

# formulaAuthor
source: Scale author
es: Autor de la escala

# clinicalUseOnly
source: For clinical use only
es: Solo para uso clínico

# coAuthor
source: Co-author: Arquimedes Montoya Pedron
es: Co-autor: Arquímedes Montoya Pedrón

# authorContact
source: Contact for advisory
es: Contacto para asesoría

source: Scientific evidence
es: Evidencia científica

# validationMetrics
source: Performance metrics
es: Métricas de rendimiento

source: Sensitivity
es: Sensibilidad

source: Specificity
es: Especificidad

source: PPV
es: VPP

source: NPV
es: VPN

source: Youden Index
es: Índice de Youden

# positiveLR
source: Positive likelihood ratio
es: Razón de verosimilitud (+)

# negativeLR
source: Negative likelihood ratio
es: Razón de verosimilitud (-)

source: AUC-ROC
es: ABCCOR

source: AUC-ROC CI
es: IC ABCCOR

source: Scientific references
es: Referencias científicas

# citation1
source: Esquivel Tamayo JA, Montoya Pedron A. Predictive model of mild neurocognitive disorder due to Alzheimer's disease in Cuban adults. Revista Mexicana de Neurociencias. 2025; 26(5).
es: Esquivel Tamayo JA, Montoya Pedrón A. Predictive model of mild neurocognitive disorder due to Alzheimer's disease in Cuban adults. Revista Mexicana de Neurociencias. 2025; 26(5).

# citation2
source: Esquivel Tamayo JA, Montoya Pedron A. Internal validation of a predictive scale for mild neurocognitive disorder due to Alzheimer's disease. Archivos de Neurociencias. 2026.
es: Esquivel Tamayo JA, Montoya Pedrón A. Validación interna de una escala predictiva de trastorno neurocognitivo leve debido a la enfermedad de Alzheimer. Archivos de Neurociencias. 2026.

source: View article
es: Ver artículo

source: Developed by
es: Desarrollado por

source: Developer
es: Desarrollador

# onboardingDescription
source: Predictive Scale for Mild Neurocognitive Disorder due to Alzheimer's Disease, based on 9 risk factors.
es: Escala predictiva de Trastorno Neurocognitivo Leve debido a la Enfermedad de Alzheimer, basada en 9 factores de riesgo.

source: Score range
es: Rango de score

source: Classification
es: Clasificación

# twoCategories
source: 2 categories (Low / High risk)
es: 2 categorías (Bajo / Alto riesgo)

source: Evaluated factors:
es: Factores evaluados:

# startButton
source: Get started
es: Comenzar

# pdfFooter
source: Generated by NRS — Esquivel Tamayo JA, Montoya Pedron A. Rev Mex Neurociencias 2025;26(5) — For clinical use only
es: Generado por ERN — Esquivel Tamayo JA, Montoya Pedrón A. Rev Mex Neurociencias 2025;26(5) — Solo para uso clínico

source: Clinical definition
es: Definición clínica

# defLowCompetence
source: Occupations classified at levels 1 and 2 according to the International Standard Classification of Occupations (ISCO-08). Includes manual labor and basic operations.
es: Ocupaciones clasificadas en los niveles 1 y 2 según la Clasificación Internacional Uniforme de Ocupaciones (CIUO-08). Incluye trabajos de labor manual y operaciones básicas.

# defHypertension
source: Blood pressure readings above 140/90 mmHg recorded on at least 2 occasions with a minimum interval of 6 hours between measurements.
es: Cifras de presión arterial superiores a 140/90 mmHg registradas en al menos 2 ocasiones con un intervalo mínimo de 6 horas entre las mediciones.

# defCovid
source: Confirmed COVID-19 diagnosis by biomolecular test (real-time PCR).
es: Diagnóstico confirmado de COVID-19 mediante prueba biomolecular (PCR en tiempo real).

# defLowEducation
source: Primary and secondary education levels according to the Cuban educational system.
es: Niveles de escolaridad de primaria y secundaria según el sistema educativo cubano.

# defObesity
source: Body mass index (BMI) greater than 30 kg/m².
es: Índice de masa corporal (IMC) superior a 30 kg/m².

# defDiabetes
source: Diagnosis based on the criteria: fasting blood glucose ≥126 mg/dL (7.0 mmol/L), 2-hour oral glucose tolerance test ≥200 mg/dL (11.1 mmol/L), glycated hemoglobin (HbA1c) ≥6.5%, or random blood glucose ≥200 mg/dL (11.1 mmol/L) with classic symptoms of hyperglycemia.
es: Diagnóstico según los criterios: glucemia en ayunas ≥126 mg/dL (7.0 mmol/L), glucemia a las 2 horas de una prueba de tolerancia oral a la glucosa ≥200 mg/dL (11.1 mmol/L), hemoglobina glucosilada (HbA1c) ≥6.5%, o glucemia al azar ≥200 mg/dL (11.1 mmol/L) con síntomas clásicos de hiperglucemia.

# defWeightLoss
source: Unintentional weight loss of at least 2 kg or 5% of body weight in the last 12 months, not attributable to diet, surgery, or known disease.
es: Pérdida de peso no intencional de al menos 2 kg o del 5% del peso corporal en los últimos 12 meses, no atribuible a dieta, cirugía o enfermedad conocida.

# defInactivity
source: In people aged 18 to 64, it is when the minimum of 150 minutes/week of moderate physical activity (walking, household activities, active games, carrying light weights), 75 minutes/week of vigorous physical activity (cycling, swimming, running, sports, heavy loads, dancing) or an equivalent combination of both is not reached.
es: En personas entre 18 y 64 años, es cuando no se alcanza el mínimo de 150 minutos/semana de actividad física moderada (caminatas, actividades domésticas, juegos con movimientos, cargar pesos ligeros), 75 minutos/semana de actividad física vigorosa (ciclismo, natación, carreras, deportes, cargas pesadas, bailes) o una combinación equivalente de ambas.

# defSmoking
source: Meets the three DSM-5 criteria for tobacco use disorder: A) consumption of larger amounts than intended over a longer period of time, B) nicotine tolerance (indicated by increasingly larger doses), C) withdrawal symptoms upon discontinuation of use.
es: Cumple con los tres criterios del DSM-5 para un trastorno por consumo de tabaco: A) consumo de cantidades mayores que las previstas por un período de tiempo más largo, B) tolerancia a la nicotina (indicada por dosis cada vez mayores), C) síntomas de abstinencia al suspender el uso.

source: Specific recommendations
es: Recomendaciones específicas

# recHypertension
source: Maintain systolic blood pressure at values ≤130 mmHg from age 40 onwards.
es: Mantener la presión arterial sistólica en valores ≤130 mmHg desde los 40 años de edad.

# recLowCompetence
source: Promote participation in cognitively stimulating activities and higher occupational complexity.
es: Promover la participación en actividades cognitivamente estimulantes y de mayor complejidad ocupacional.

# recLowEducation
source: Facilitate access to educational programs and cognitive stimulation activities.
es: Facilitar el acceso a programas educativos y actividades de estimulación cognitiva.

# recCovid
source: Perform periodic neurological follow-up in patients with a history of COVID-19.
es: Realizar seguimiento neurológico periódico en pacientes con antecedente de COVID-19.

# recObesity
source: Maintain a healthy body weight and treat obesity early.
es: Mantener un peso corporal saludable y tratar la obesidad de forma precoz.

# recDiabetes
source: Prevent and treat diabetes mellitus, maintain a healthy weight, and engage in regular physical activity.
es: Prevenir y tratar la diabetes mellitus, mantener un peso saludable y realizar actividad física regular.

# recWeightLoss
source: Monitor nutritional status and rule out underlying causes of unintentional weight loss.
es: Monitorear el estado nutricional y descartar causas subyacentes de pérdida de peso no intencional.

# recInactivity
source: Incorporate regular physical exercise, ideally at least 150 minutes of moderate aerobic activity per week.
es: Incorporar ejercicio físico regular, idealmente actividad aeróbica moderada al menos 150 minutos por semana.

# recSmoking
source: Reduce tobacco use and participate in smoking cessation counseling programs.
es: Reducir el consumo de tabaco y participar en programas de consejería para la cesación tabáquica.

source: Filters (active)
es: Filtros (activos)

# selectAssessmentsCount
source: Select 2 assessments ({count}/2)
es: Selecciona 2 evaluaciones ({count}/2)

# clearAllFilters
source: Clear filters
es: Limpiar filtros

source: Assessment from {date}
es: Evaluación del {date}

# versionEditedDate
source: Version {version} — edited on {date}
es: Versión {version} — editada el {date}

# versionLabel
source: Version {version}
es: Versión {version}

source: Edited: {date}
es: Editada: {date}

# factorChangeToActive
source: {factor}: No → Yes
es: {factor}: No → Sí

# factorChangeToInactive
source: {factor}: Yes → No
es: {factor}: Sí → No

source: Notes: {content}
es: Notas: {content}

# evaluationsCount
source: {count} assessments
es: {count} evaluaciones

source: Clinical recommendation
es: Recomendación clínica

source: Aggregate Statistics
es: Estadísticas Agregadas

source: Generated: {date}
es: Generado: {date}

source: General summary
es: Resumen general

# totalPatientsLabel
source: Total patients
es: Total de pacientes

# totalAssessmentsLabel
source: Total assessments
es: Total de evaluaciones

source: Average score
es: Score promedio

# factorFrequency
source: Risk factor frequency
es: Frecuencia de factores de riesgo

source: Amount
es: Cantidad

source: Present
es: Presente

# nameLabel
source: Name
es: Nombre

# codeLabel
source: Code
es: Código

# assessmentDateLabel
source: Assessment date: {date}
es: Fecha de evaluación: {date}

# versionInParens
source: (Version {version})
es: (Versión {version})

# scoreTotalDisplay
source: Total score: {score} / {max}
es: Score total: {score} / {max}

# assessmentDateHeader
source: Assessment Date
es: Fecha Evaluación

# totalScoreHeader
source: Total Score
es: Score Total

# csvExportSubject
source: Assessment export - {appName}
es: Exportación de evaluaciones - {appName}

# reevaluationPending
source: Pending reevaluation
es: Reevaluación pendiente

# reevaluationScheduled
source: Patient {name} has a scheduled reevaluation
es: El paciente {name} tiene una reevaluación programada
